Autodesk.Revit.DB.ElementNode.LinkInstanceId
The Id of the link instance for the element.
Since:
2020

Autodesk.Revit.DB.ElementNode.Document
Gets the document associated with the element.
Remarks:
The document is in read-only state. Transactions are not allowed in it.
Since:
2020

Autodesk.Revit.DB.ElementNode.ElementId
The Id of the element.
Since:
2020

Autodesk.Revit.DB.ElementNode
A render node that represents an element, including the host document containing the element.
Remarks:
See also: Autodesk.Revit.DB.IExportContext2D.OnElementBegin2D(Autodesk.Revit.DB.ElementNode).
See also: Autodesk.Revit.DB.IExportContext2D.OnElementEnd2D(Autodesk.Revit.DB.ElementNode).
Since:
2020